Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: I can barely afford to buy enough food to feed my family.
hi: अपने परिवार के लिए खाना खरीदना भी मेरे लिए मुश्किल है।

source: I can come if you want.
hi: तुम चाहो तो मैं आ सकता हूँ।

source: I can hear you.
hi: मुझे तुम सुनाई दे रहे हो।

source: She's always been a very cheerful person.
hi: वह हमेशा से ही खुशमिज़ाज रही है।

source: He was sitting on the sofa in our room.
hi: वह हमारे कमरे के सोफे पर बैठे थे.

source: Have you spoke to him in the past few days?
hi: क्या तुमने उस से बीते दिनों में वार्तालाप की है?

source: I woke up at 4 AM that day.
hi: मैं उस दिन सुबह ५ बजे उठ गयी थी.

source: I want to live here.
hi: मैं यहाँ रहना चाहता हूँ।

source: I already know.
hi: मुझे पहले से ही पता है।

source: Mr. President, my name is Khan and I am not a terrorist.
hi: राष्ट्रपति जी, मेरा नाम खान है, और मैं आतंकवादी नहीं हूँ।

source: I don't think I can wait that long.
hi: मैं उतनी देर रुक नहीं सकता।

source: I live in Lahore.
hi: मैं लाहोर में रहता हूं।

source: I have lost my keys.
hi: मेरी चावी गुम हो गयी है।

source: I've lost my key.
hi: मेरी चावी गुम हो गयी है।

source: The drug smuggler was arrested at the airport.
hi: दवा तस्कर हवाई अड्डे पर गिरफ्तार किया गया था।

source: Like talking to a wall.
hi: भैंस के आगे बीन बजाना।

source: Better to have something than nothing.
hi: न होने से कुछ होना बेहतर है.

source: A drowning man will clutch at a straw.
hi: डूबते को तिनके का सहारा।

source: She is taller than me.
hi: वह मेरे से लंबी है।

source: I had a lovely night.
hi: मेरी रात मनमोहक रही।

source: They eat meat.
hi: वे मांस खाते हैं।

source: The czar was the ruler of Russia.
hi: ज़ार रूस का शासक था।

source: The tsar was the ruler of Russia.
hi: ज़ार रूस का शासक था।

source: The sky was blue.
hi: आकाश नीला था।

source: The sky was red.
hi: आकाश लाल था।

source: We can't drink milk.
hi: हम दूध नहीं पी सकते।

source: Let's listen.
hi: सुनते हैं।

source: I have a gun.
hi: मेरे पास एक बंदूक है।

source: I have a key.
hi: मेरे पास एक चाबी है।

source: I have a ring.
hi: मेरे पास एक अँगुठी है।

source: I've already read that document.
hi: मैंने वह दस्तावेज पहले से ही पढ़ लिया है।

source: I've already read that novel.
hi: मैंने वह उपन्यास पहले से ही पढ़ा है।

source: I've been given a three-year sentence.
hi: मुझे तीन साल की सज़ा दी गई है।

source: I've got a gun.
hi: मेरे पास एक बंदूक है।

source: I've got plenty of food.
hi: मेरे पास बहुत सारा खाना है।

source: I haven't heard that name in years.
hi: मैंने वह नाम कई सालों से नहीं सुना है।

source: I've let everybody down.
hi: मैंने सभी को निराश कर दिया है।

source: I don't live in Boston.
hi: मैं बोस्टन में नहीं रहता हूँ।

source: I don't love you that much.
hi: मैं तुम से उतना प्यार नहीं करता।

source: I don't want to hear that word.
hi: मुझे वह शब्द सुनना नहीं है।

source: I have a gut feeling that Tom won't pass the test.
hi: मुझे नहीं लगता कि टॉम परीक्षा में उत्तीर्ण होगा।

source: I won't let Tom do that.
hi: मैं टॉम को वैसे करने नहीं दूंगा।

source: I'm proud to be a Canadian.
hi: मुझे कैनेडियन होने पर गर्व है।

source: I just downloaded a lot of files.
hi: मैंने अभी-अभी बहुत सारी फाइलें डाउनलोड की हैं।

source: She's wearing red.
hi: उसने लाल कपड़े पहने हैं।

source: Thanks for helping me!
hi: मेरी मदद करने के लिये शुक्रिया!

source: I knew you'd quit.
hi: मैं जानता था तुम छोड़ दोगे।

source: I know Tom cheated.
hi: मुझे पता है की टॉम ने धोखा दिया।

source: I know Tom well.
hi: मैं टॉम को अच्छी तरह से जानता हूँ।

source: I know what the answer will be.
hi: जवाब क्या होगा मुझे पता है।

source: I like almonds, but not peanuts.
hi: मुझे बदाम पसंद हैं, मगर मूँगफली नहीं।

source: I like this shirt.
hi: मुझे यह कमीज़ पसंद है।

source: I like this song.
hi: मुझे यह गाना पसंद है।

source: I live here now.
hi: मैं अब यहाँ रहता हूँ।

source: I live in a hotel.
hi: मैं एक होटल में रहता हूँ।

source: I live in Boston, too.
hi: मैं भी बॉस्टन में ही रहता हूँ।

source: I lived with Tom for three years.
hi: मैं टॉम के साथ तीन साल रहा हूँ।

source: I love you guys.
hi: में तुम लोगो से प्यार करता हुँ ।

source: I owed him a thousand dollars.
hi: मुझे उसे हजार डालर देने थे।

source: I never worry.
hi: मैं कभी चिंता नहीं करता।

source: I opened the door.
hi: मैंने दरवाज़ा खोला।

source: I opened the window.
hi: मैंने खिड़की खोली।

source: Tom was raped by his father.
hi: टॉम के पिता ने उस पर बलात्कार किया।

source: I remember when I first saw you.
hi: मुझे हमारी पहली मुलाकात याद है।

source: Portuguese is beautiful but not easy.
hi: पुर्त्तगाली सुंदर है, मगर आसान नहीं।

source: Are you listening to the radio?
hi: रेडियो सुन रहे हो क्या?

source: I do a lot of things.
hi: मैं बहुत सारे चीज़ें करता हूँ।

source: It is possible.
hi: मुमकिन है।

source: My family loved Tom.
hi: मेरे परिवार को टॉम पसंद था।

source: I always have misconceptions, too.
hi: मुझे भी हमेशा गलतफ़हमियाँ होती हैं।

source: Why do I need to learn French?
hi: मुझे फ़्रांसीसी सीखने की क्या ज़रूरत है?

source: What would life be if we had no courage to attempt anything?
hi: जीवन का अर्थ ही क्या रह जाएगा यदि हम में सतत प्रयत्न करने का साहस न रहे।

source: I saw Tom smoking a cigarette.
hi: मैंने टॉम को सिगरेट पीते हुए देखा।

source: I should've told Tom everything.
hi: मुझे टौम को सब कुछ बता देना चाहिए था।

source: I still have your key.
hi: तुम्हारी चाबी अभी भी मेरे पास है।

source: I think I need help.
hi: लगता है मुझे सहायता की आवश्यकता है।

source: I think Tom and Mary are right.
hi: मुझे लगता है टॉम और मैरी सही हैं।

source: These are very big apples.
hi: ये सेब बहुत बड़े हैं।

source: The water is not drinkable.
hi: यह पानी पिया नहीं जा सकता है।

source: The revolution has its own laws.
hi: क्रांति के अपने ही नियम होते है।

source: They bring cloth from England.
hi: वे इंग्लैंड से कपड़ा लाते हैं।

source: I don't know German.
hi: मुझे जर्मन नहीं आती।

source: Excuse me!
hi: सुनिए।

source: I will gift you a cycle on your birthday.
hi: मैं तुम्हे तुम्हारे जन्मदिन पर साइकिल तोहफे में दूँगी.

source: He took something out from his pocket.
hi: उसने अपनी जेब में से कुछ निकाला.

source: He pulled something out of his pocket.
hi: उसने अपनी जेब में से कुछ निकाला.

source: Thank you so much, my friends!
hi: आपका बहुत बहुत शुक्रिया, मेरे दोस्तों!

source: She is a singer.
hi: वह गायिका है।

source: There's a cat there.
hi: वहाँ एक बिल्ली है।

source: Tom hates school.
hi: टॉम को स्कूल से नफ़रत है।

source: I will not come tomorrow.
hi: मैं कल नहीं आउंगा।

source: He has very strong arms.
hi: उसकी बाँहों में बहुत ताक़त है।

source: The soul is eternal.
hi: आत्मा अनन्त है।

source: He's Tony.
hi: वह टोनी है।

source: Where did you meet Marika?
hi: तुम मारिका से कहाँ मिले?

source: Do you still want to talk to me?
hi: क्या तुम अभी भी मुझ से बात करना चाहते हो?

source: They're playing together.
hi: वे एक-साथ खेल रहे हैं।

source: Tom was at home alone.
hi: टॉम घर पर अकेला था।

source: Tom's book was translated into French.
hi: टॉम की किताब फ़्रांसीसी में अनुवादित की गयी।

source: I've written several songs in French.
hi: मैंने फ़्रांसीसी में कई गाने लिखे हैं।

source: Do you have a French dictionary?
hi: क्या आपके पास फ्रेंच भाषा का शब्दकोष है?

source: The Vatican is an independent country.
hi: वैटिकन एक स्वतंत्र देश है।

source: I am a fly!
hi: मैं मक्खी हूँ!

source: Here are their books.
hi: यह रहे उनके किताब।

source: Tom had two choices.
hi: टॉम के पास दो विकल्प थे।

source: My dad doesn't hate you.
hi: मेरे पापा तुम से नफ़रत नहीं करते।

source: For what reason?
hi: किस वजह से?

source: My favourite movie is Fellini's Satyricon.
hi: मेरी पसंदीदा फ़िल्म है फ़ेल्लीनी की सॅटाइरिकॉन।

source: Tom, where are we?
hi: टॉम, हम कहाँ है?

source: Pikachu is a Pokémon.
hi: पिकाचु एक पोकेमॉन है।

source: I have nothing else.
hi: मेरे पास और कुछ नहीं है।

source: She didn't even say thanks.
hi: उसने तो शुक्रिया तक नहीं कहा।

source: He's Italian.
hi: वह इतालवी है।

source: You can close your eyes to reality but not to memories.
hi: आप वास्तविकता से अपनी आंखे मूंद सकते हैं, मगर स्मृतियों से नहीं।

source: I eat cheese.
hi: मैं चीज़ खाता हूँ।

source: I always say goodbye, and I stay.
hi: मै हमेशा अलविदा कहता हूं और रूक जाता हूं।

source: Where did this come from?
hi: यह कहाँ से आ गया?

source: I want to go to Germany.
hi: मैं जर्मनी जाना चाहता हूँ।

source: He made me cry.
hi: उसने मुझे रुलाया।

source: She is my friend.
hi: वह मेरी दोस्त है।

source: My name is Laurie.
hi: मेरा नाम लौरी है।

source: I'm not Darth Vader.
hi: मैं डार्थ वेडर नहीं हूँ।

source: Ireland is a very beautiful country.
hi: आयरलैंड एक सुंदर देश है।

source: My spoon is bigger!
hi: मेरा चमच ज़्यादा बड़ा है!

source: Tom is alive!
hi: टॉम ज़िंदा है!

source: He's from Germany.
hi: वह जर्मनी से है।

source: The water was blue.
hi: पानी नीला था।

source: She plays poker with them.
hi: वह उनके साथ पोकर खेलती है।

source: There's a rumor that Tom is gay.
hi: अफवाह है कि टॉम गे है।

source: Athens is in Greece.
hi: एथेंस यूनान में है।

source: How far?
hi: कितने दूर?

source: I'll go to Greece.
hi: मैं यूनान जाऊँगा।

source: It may not be necessary for us to go to that meeting.
hi: शायद हमें उस मीटिंग में जाने की ज़रूरत नहीं पड़ेगी।

source: Tom wouldn't be here if it wasn't for me.
hi: मैं ना होता तो टॉम आज यहाँ नहीं होता।

source: Tom, Mary and John are eating breakfast.
hi: टॉम, मैरी और जॉन नाश्ता कर रहे हैं।

source: The room didn't have a single window.
hi: कमरे में एक भी खिड़की नहीं थी।

source: This isn't a violin. It's a viola.
hi: यह वायलिन नहीं है। यह वायोला है।

source: What does Tom eat for breakfast?
hi: टॉम नाश्ते में क्या खाता है?

source: I'm not going anywhere with you.
hi: मैं तुम्हारे साथ कहीं नहीं जा रहा।

source: You were with me on that night.
hi: उस रात तुम मेरे साथ थे।

source: I'm not going to tell Tom that.
hi: वह बात मैं टॉम को नहीं बताने वाला.

source: I'll need about five minutes.
hi: मुझे लग-भग पाँच मिनट लगेंगे।

source: Someone's in the other room.
hi: दूसरे कमरे में कोई है।

source: We're asking the questions.
hi: सवाल हम पूछ रहे हैं।

source: Tom, your life's in danger.
hi: टॉम, तुम्हारी जान खतरे में हे।

source: Tom, you've got to help me.
hi: टॉम, तुम्हें मेरी मदद करनी ही होगी।

source: Tom wouldn't do that to me.
hi: टॉम मेरे साथ वैसा नहीं करेगा।

source: Tom would've thrown us out.
hi: टॉम ने हमें बाहर फेंक दिया होता।

source: If Tom dies, what'll we do?
hi: अगर टॉम मर गया, तो हम क्या करेंगे?

source: I'm telling the truth, Tom.
hi: मैं सच कह रहा हूँ, टॉम।

source: I'm staying at Tom's house.
hi: मैं टॉम के घर रह रहा हूँ।

source: I'm sitting here in my car.
hi: मैं यहाँ मेरी गाड़ी में बैठा हूँ।

source: I'm leaving that up to you.
hi: मैं वह तुम पर छोड़ रहा हूँ।

source: I'm going to work with Tom.
hi: मैं टॉम के साथ काम करने वाला हूँ।

source: I'll turn thirty next week.
hi: मैं अगले हफ़्ते तीस साल का हो जाऊँगा।

source: I'll teach you many things.
hi: मैं तुम्हें बहुत सारी चीज़ें सिखाऊंगा।

source: I'm going to the hospital.
hi: मैं अस्पताल जा रहा हूँ।

source: I was in my room studying.
hi: मैं मेरे कमरे में पढ़ाई कर रहा था।

source: We're friends, aren't we?
hi: हम दोस्त हैं, है ना?

source: I'm not that kind of guy.
hi: मैं वैसा व्यक्ति नहीं हूँ।

source: I'm not playing with you.
hi: मैं तुम्हारे साथ नहीं खेल रहा।

source: I'm asking for your help.
hi: मैं तुम्हारी मदद माँग रहा हूँ।

source: You're not my assistant.
hi: तुम मेरे सहायक नहीं हो।

source: You're my new assistant.
hi: तुम मेरे नये सहायक हो।

source: We're your friends, Tom.
hi: हम तुम्हारे दोस्त हैं, टॉम।

source: We're worried about you.
hi: हमें तुम्हारी चिंता हो रही है।

source: Tom put on his raincoat.
hi: टॉम ने अपना रेनकोट पहना।

source: Tom isn't wearing a tie.
hi: टॉम ने टाई पहना नहीं है।

source: They're all watching us.
hi: वे सब हमें देख रहे हैं।

source: I'm taking them with me.
hi: मैं उन्हें अपने साथ ले जा रहा हूँ।

source: I'm giving you a chance.
hi: मैं तुम्हें एक मौका दे रहा हूँ।

source: What's behind the door?
hi: उस दरवाज़े के पीछे क्या है?

source: We're watching a movie.
hi: हम एक फ़िल्म देख रहे हैं।

source: That wasn't the reason.
hi: वह कारण नहीं था।

source: I'm trying to help Tom.
hi: मैं टॉम की मदद करने की कोशिश कर रही हूँ।

source: I'm the one who's sick.
hi: बीमार तो मैं हूँ।

source: I'm taking you with me.
hi: मैं तुम्हें मेरे साथ ले जा रहा हूँ।

source: I'm taking Tom with me.
hi: मैं टॉम को अपने साथ ले जा रहा हूँ।

source: I'm sitting right here.
hi: मैं यहीं बैठा हूँ।

source: You're a good soldier.
hi: तुम एक अच्छे सैनिक हो।

source: You have good friends.
hi: तुम्हारे पास अच्छे दोस्त हैं।

source: Tom is also an artist.
hi: टॉम कलाकार भी है।

source: I'm not going outside.
hi: मैं बाहर नहीं जा रहा।

source: I'm going to help you.
hi: मैं तुम्हारी मदद करने वाला हूँ।

source: I'll apologize to Tom.
hi: मैं टॉम से माफ़ी मांगूंगा।

source: You're a soldier now.
hi: अभी तुम सैनिक हो।

source: What're you watching?
hi: क्या देख रहे हो?

source: Tom's my friend, too.
hi: टॉम मेरा भी दोस्त है।

source: Tom wasn't with Mary.
hi: टॉम मैरी के साथ नहीं था।

source: Tom wasn't surprised.
hi: टॉम को आश्चर्य नहीं हुआ था।

source: They're not my rules.
hi: वे मेरे नियम नहीं हैं।

source: They're in my office.
hi: वे मेरे दफ्तर में हैं।

source: I'm working here now.
hi: मैं अभी यहाँ काम कर रहा हूँ।

source: I'm proud of you all.
hi: मुझे तुम सब पर गर्व है।

source: I'm nothing like you.
hi: मैं तुम्हारी तरह बिलकुल भी नहीं हूँ।

source: I'm not your brother.
hi: मैं तुम्हारा भाई नहीं हूँ।

source: I'm not stopping you.
hi: मैं तुम्हें नहीं रोक रहा।

source: I'm not ready to die.
hi: मैं मरने के लिये तैयार नहीं हूँ।

source: I'm in the air force.
hi: मैं वायु सेना में हूँ।

source: I'm going to the gym.
hi: मैं जिम जा रहा हूँ।

source: I'm going to my room.
hi: मैं मेरे कमरे में जा रहा हूँ।

source: I'm going to bed now.
hi: मैं अभी सोने जा रहा हूँ।

source: I'm going to be late.
hi: मुझे देर होने वाली है।

source: I'm giving it to Tom.
hi: मैं टॉम को दे रही हूँ।

source: I'm coming home, Tom.
hi: मैं घर आ रहा हूँ, टॉम।

source: You've defeated Tom.
hi: तुमने टॉम को हरा दिया है।

source: You're our prisoner.
hi: तुम हमारे कैदी हो।

source: You're all the same.
hi: तुम सब एक जैसे हो।

source: It's true, isn't it?
hi: यह सच है, है ना?

source: It's nice, isn't it?
hi: अच्छा है, है ना?

source: It's cool, isn't it?
hi: ठंडा है, है ना?

source: I'm writing my will.
hi: मैं अपना इच्छापत्र लिख रहा हूँ।

source: I'm wasting my time.
hi: मैं मेरा वक़्त बरबाद कर रहा हूँ।

source: I'm so proud of Tom.
hi: मुझे टॉम पर कितना गर्व है।

source: I'm right here, Tom.
hi: मैं यहीं हूँ, टॉम।

source: I'm not coming home.
hi: मैं घर नहीं आ रहा हूँ।

source: I'm headed that way.
hi: मैं उसी रास्ते जा रहा हूँ।

source: I'm happy right now.
hi: मैं इस वक़्त खुश हूँ।

source: I'm completely deaf.
hi: मैं पूरी तरह से बहरा हूँ।

source: I'm afraid of death.
hi: मैं मौत से डरता हूँ।

source: I'll watch the door.
hi: मैं दरवाज़े पर नज़र रखता हूँ।

source: I'll tell you later.
hi: मैं तुम्हें बाद में बताता हूँ।

source: I'll find you later.
hi: मैं तुम्हें बाद में ढूंढ लूंगा।

source: I'll bring the wine.
hi: मैं शराब लाता हूँ।

source: You've got an hour.
hi: तुम्हारे पास एक घंटा है।

source: You're married now.
hi: तुम अब शादीशुदा हो।

source: Why isn't Tom here?
hi: टॉम यहाँ क्यों नहीं है?

source: Where are the kids?
hi: बच्चे कहाँ गए?

source: Where are the guns?
hi: बंदूकें कहाँ हैं?

source: We're all like Tom.
hi: हम सब टॉम जैसे हैं।

source: We'll have to wait.
hi: हमें रुकना पड़ेगा।

source: Tom's nose was red.
hi: टॉम का नाक लाल था।

source: Tom's dog stood up.
hi: टॉम का कुत्ता खड़ा हुआ।

source: Tom has black hair.
hi: टॉम के पास काले बाल हैं।

source: I'll get your coat.
hi: मैं तुम्हारा कोट लाता हूँ।

source: We know about Tom.
hi: हम टॉम के बारे में जानते हैं।

source: We haven't failed.
hi: हम असफल नहीं हुए हैं।

source: Tom will be found.
hi: टॉम मिल जाएगा।

source: Tom was very sick.
hi: टॉम बहुत बीमार था।

source: Tom is in my room.
hi: टॉम मेरे कमरे में है।

source: I'm not safe here.
hi: मैं यहाँ सुरक्षित नहीं हूँ।

source: I'm just a friend.
hi: मैं बस एक दोस्त हूँ।

source: I'm going to stay.
hi: मैं रहने वाला हूँ।

source: I'll do just that.
hi: मैं बिलकुल वहीं करूँगा।

source: You'll be OK now.
hi: तुम अभी ठीक हो जाओगे।

source: I'm in here, Tom.
hi: मैं यहाँ अंदर हूँ, टॉम।

source: I'm here for Tom.
hi: मैं यहाँ टॉम के लिये आया हूँ।

source: Tom was worried.
hi: टॉम चिंतित था।

source: Scary, isn't it?
hi: डरावना है, ना?

source: I'm over thirty.
hi: मेरी उम्र तीस से ज्यादा है।

source: I'm not on duty.
hi: मैं ड्यूटी पर नहीं हूँ।

source: I'm in the band.
hi: मैं उस बैंड में हूँ।

source: Crows are black.
hi: कौवे काले होते हैं।

source: Tom was eating.
hi: टॉम खा रहा था।

source: You came back.
hi: तुम लौटे।

source: They had guns.
hi: उनके पास बंदूकें थी।

source: I'm unmarried.
hi: मैं अविवाहित हूँ।

source: Tom is alive.
hi: टॉम ज़िंदा है।

source: Tom got home.
hi: टॉम घर पहुँचा।

source: They're blue.
hi: वे नीले हैं।

source: It was round.
hi: गोलाकार था।

source: It was black.
hi: काला था।

source: It was a bet.
hi: शर्त थी।

source: Is it a wolf?
hi: भेड़िया है?

source: What's next?
hi: इसके बाद क्या है?

source: Tom slipped.
hi: टॉम फिसला।

source: They're red.
hi: वे लाल हैं।

source: Watch this.
hi: यह देख।

source: What could I do?
hi: मैं क्या करता?

source: What would the king know of Diwali?
hi: राजा को दिवाली क्या पता?

source: A dead rooster does not fear the fire.
hi: मरा हुआ मुर्गा आग से डरता नहीं.

source: If you live in the water, do not feud with the fishes.
hi: पानी में रह कर मछली से वैर?

source: The poet sees what the sun does not.
hi: जो न देखे रवि वह देखे कवि।

source: Like master, like disciple.
hi: जैसा गुरू वैसा चेला।

source: He who climbs up, will fall down.
hi: चढ़ेगा वह गिरेगा।

source: There is a howdah on the horse and a saddle on the elephant.
hi: घोडे पर हौदा, हाथी पर ज़ीन।

source: You can't clap with just one hand.
hi: एक हाथ से ताली नहीं बजती।

source: You were young.
hi: तुम जवान थे।

source: The Industrial Revolution began in England.
hi: औद्योगिक क्रांति इंग्लैंड में शुरू हुई।

source: My name is Emily.
hi: मेरा नाम एमिली है।

source: What do you know about Germany?
hi: तुम जर्मनी के बारे में क्या जानते हो?

source: He who is present, is the vizier.
hi: हाज़िर वह वज़ीर।

source: If you must kill, kill an elephant and if you must rob, rob a treasury.
hi: मारें तो हाथी और लूटें तो भंडार।

source: The mind is the king and the mind is the subject.
hi: मन राजा, मन प्रजा।

source: First God, then food.
hi: पहले भगवान, फिर भोजन।

source: I know that you still cry for me sometimes.
hi: मुझे पता है कि, तुम अभी भी मेरे लिए आंसू बहाते हो कभी कभी।

source: Not only does a rock drown, but it drowns others with it.
hi: ख़ुद डूब कर पत्थर दूसरे को डुबो देता है।

source: Water cannot be separated by hitting it with a stick.
hi: छड़ी मारने से पानी अलग नहीं होता।

source: The sun of the east shall rise in the west.
hi: पूरब का सूरज पश्चिम में उगेगा।

source: A sea of words, but only a drop of sense.
hi: शब्दों का सिंधु मगर अक़्ल का एक बिंदु।

source: Rain does not fall from the ground.
hi: ज़मीन से बारिश नहीं गिरती।

source: If so believed, it is God; if not, it is a stone.
hi: माना तो भगवान, नहीं तो पत्थर।

source: He has gone to Spain.
hi: वह स्पेन गया है।

source: The name of the restaurant is "Old Europe".
hi: रेस्तराँ का नाम "पुराना युरोप" है।

source: Who is Tom?
hi: टॉम कौन है?

source: She is playing with her friends.
hi: वह अपने दोस्तों के साथ खेल रही है।

source: London is the capital of the United Kingdom.
hi: संयुक्त राज्य की राजधानी लंदन है।

source: Italian is my native language.
hi: इतालवी मेरी मातृभाषा है।

source: We'll go after we eat.
hi: हम खाना खाने के बाद जायेंगे|

source: Where there is Jeevan, there is Asha.
hi: जहाँ जीवन, वहाँ आशा।

source: Why do you want to learn English?
hi: तुम अंग्रेज़ी क्यों सीखना चाहते हो?

source: I am a Christian.
hi: मैं एक ईसाई हूँ।

source: My car is red.
hi: मेरी गाड़ी लाल रंग की है।

source: OK.
hi: ठीक है।

source: They don't understand English at all.
hi: वह अंग्रेज़ी बिलकुल भी नहीं समझते.

source: You don't understand English at all.
hi: आपको अंग्रेज़ी बिलकुल भी समझ नहीं आती।

source: I have no such desire.
hi: मेरी ऐसी कोई इच्छा नहीं है।

source: The king is naked!
hi: राजा तो नंगा है!

source: It should be revoked immediately.
hi: इसे तुरंत वापस लिया जाना चाहिए

source: Greece is an European country.
hi: यूनान यूरोपीय देश है।

source: Bangladesh is an Asian country.
hi: बांग्लादेश एक एशियाई देश है।

source: Are you in Bangladesh?
hi: क्या तुम बांग्लादेश में हो?

source: We're friends, and friends help each other.
hi: हम दोस्त हैं, और दोस्त एक-दूसरे की मदद करते हैं।

source: I'm Russian.
hi: मैं रूसी हूँ।

source: Emily is afraid of spiders.
hi: ऐमिली मकडियों से डरती है।

source: Emily isn't afraid of spiders.
hi: ऐमिली मकडियों से डरती नहीं।

source: I live in Europe.
hi: मैं युरोप में रहता हूँ।

source: I live in a European country.
hi: मैं एक यूरोपीय देश में रहता हूँ।

source: My name is Ricardo.
hi: मेरा नाम रिकार्डो है।

source: That's all they have.
hi: उनके पास उतना ही है।

source: He's a funny man.
hi: वह मज़ेदार आदमी है।

source: Moscow is the capital of Russia.
hi: मास्को रूस की राजधानी है।

source: Riga is the capital of Latvia.
hi: लातविया की राजधानी रिगा है।

source: Athens is the capital of Greece.
hi: एथेंस यूनान की राजधानी है।

source: Lisbon is the capital of Portugal.
hi: पुर्तगाल की राजधानी लिस्बन है।

source: Tom and Mary want to know what our plan is.
hi: टॉम और मेरी हमारा प्लैन जानना चाहते हैं।

source: Tom and Mary swam together every morning.
hi: टॉम और मैरी हर सुबह एक-साथ तैरते थे।

source: Tom and Mary understood each other.
hi: टॉम और मैरी एक-दूसरे को समझते थे।

source: Tom was satisfied with the result.
hi: नतीजे से टॉम संतुष्ट था।

source: Tom is watching TV in his room.
hi: टॉम अपने कमरे में टीवी देख रहा है।

source: Tom will go to Boston with me.
hi: टॉम मेरे साथ बोस्टन जाएगा।

source: Tom and Mary are still inside.
hi: टॉम और मैरी अभी भी अंदर हैं।

source: They have one thing in common.
hi: उनमें एक चीज़ समान है।

source: You're wearing my shirt, Tom.
hi: तुमने मेरी शर्ट पहन रखी है, टॉम।

source: What're you looking at, Tom?
hi: तुम क्या देख रहे हो, टॉम?

source: Tom knew nothing about Mary.
hi: टॉम को मैरी के बारे में कुछ भी नहीं पता था।

source: My room has only one window.
hi: मेरे कमरे में बस एक ही खिड़की है।

source: Tom and Mary both said yes.
hi: टॉम और मैरी दोनों ने हाँ कहा।

source: Tom and I'll both be there.
hi: टॉम और मैं दोनों वहाँ रहेंगे।

source: Have you ever seen a ghost?
hi: कभी कोई भूत देखा है?

source: Get Tom something to drink.
hi: टॉम को कुछ पिलाओ।

source: Do you remember that night?
hi: वह रात याद है?

source: You're on the wrong floor.
hi: तुम गलत मंज़िल पर हो।

source: You'll understand someday.
hi: तुम किसी दिन समझ जाओगे।

source: You'll need a screwdriver.
hi: तुम्हें एक स्क्रू ड्राइवर लगेगा।

source: Why is Tom wearing a coat?
hi: टॉम ने कोट क्यों पहन रखा है?

source: Why has Tom been arrested?
hi: टॉम को गिरफ़्तार क्यों किया गया है?

source: Where were you that night?
hi: तुम उस रात कहाँ थे?

source: Where are you from anyway?
hi: वैसे तुम हो कहाँ के?

source: What's your lawyer's name?
hi: तुम्हारे वकील का नाम क्या है?

source: Tom won't let you do that.
hi: टॉम तुम्हें वैसे करने नहीं देगा।

source: What was in the envelope?
hi: लिफ़ाफ़े में क्या था?

source: Tom wants something else.
hi: टॉम को कुछ और चाहिए।

source: Tom used to be a soldier.
hi: टॉम सैनिक हुआ करता था।

source: Tom ignored the question.
hi: टॉम ने उस सवाल को नज़रअंदाज़ कर दिया।

source: Why aren't you sleeping?
hi: तुम सो क्यों नहीं रहे?

source: What were they thinking?
hi: वे क्या सोच रहे थे?

source: What they did was wrong.
hi: उन्होंने जो किया वह गलत था।

source: What should we do first?
hi: हमें पहले क्या करना चाहिए?

source: Is this your girlfriend?
hi: क्या यह तुम्हारी गर्लफ़्रेंड है?

source: You'll need this again.
hi: तुम्हें इसकी फिर ज़रूरत पड़ेगी।
